---
kind: method
id: M:Autodesk.Revit.DB.PartUtils.IsPartDerivedFromLink(Autodesk.Revit.DB.Part)
source: html/0dba54fe-2b41-b827-86cf-b97d5f550c64.htm
---
# Autodesk.Revit.DB.PartUtils.IsPartDerivedFromLink Method

Is the Part derived from link geometry.

## Syntax (C#)
```csharp
public static bool IsPartDerivedFromLink(
	Part dPart
)
```

## Parameters
- **dPart** (`Autodesk.Revit.DB.Part`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null